Dataset/Advanced/Rectangular_Obstacle_SA/GT_Files/0/nuTilda
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}

dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 1e-6;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1e-6;
    }
    outlet
    {
        type            zeroGradient;
    }
    wall1
    {
        type            nutkWallFunction;
        value           uniform 1e-6;
    }
    wall2
    {
        type            nutkWallFunction;
        value           uniform 1e-6;
    }
    defaultfaces
    {
        type            empty;
    }
    cylinder   // your obstacle patch name (e.g. “cylinder” or “posts”)
    {
        type            nutkWallFunction;
        value           uniform 1e-6;
    }
}

