Dataset/Advanced/Rectangular_Obstacle_SA/GT_Files/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application="pimpleFoam"

runApplication blockMesh
runApplication $application
